src/exps/fio_benchmarks/paperexps/CMR-128G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=24078: Fri Sep 28 21:54:15 2018
  write: IOPS=246, BW=985KiB/s (1009kB/s)(173MiB/180002msec)
    clat (usec): min=160, max=94976, avg=4051.21, stdev=2591.50
     lat (usec): min=161, max=94977, avg=4052.09, stdev=2591.50
    clat percentiles (usec):
     |  1.00th=[ 2180],  5.00th=[ 2606], 10.00th=[ 2835], 20.00th=[ 3064],
     | 30.00th=[ 3228], 40.00th=[ 3359], 50.00th=[ 3523], 60.00th=[ 3752],
     | 70.00th=[ 4015], 80.00th=[ 4424], 90.00th=[ 4948], 95.00th=[ 5538],
     | 99.00th=[13435], 99.50th=[14615], 99.90th=[34866], 99.95th=[36439],
     | 99.99th=[77071]
   bw (  KiB/s): min=  592, max= 1407, per=79.08%, avg=778.98, stdev=57.71, samples=359
   iops        : min=  148, max=  351, avg=194.37, stdev=14.42, samples=359
  lat (usec)   : 250=0.12%, 500=0.14%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.31%, 4=68.69%, 10=27.21%, 20=3.24%, 50=0.26%
  lat (msec)   : 100=0.02%
  cpu          : usr=0.28%, sys=0.81%, ctx=44335, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,44331,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=24342: Fri Sep 28 21:54:15 2018
  write: IOPS=247, BW=989KiB/s (1013kB/s)(290MiB/300001msec)
    clat (usec): min=175, max=203142, avg=4035.58, stdev=2534.21
     lat (usec): min=175, max=203143, avg=4036.45, stdev=2534.21
    clat percentiles (usec):
     |  1.00th=[ 2212],  5.00th=[ 2606], 10.00th=[ 2835], 20.00th=[ 3064],
     | 30.00th=[ 3228], 40.00th=[ 3359], 50.00th=[ 3523], 60.00th=[ 3752],
     | 70.00th=[ 4015], 80.00th=[ 4490], 90.00th=[ 4948], 95.00th=[ 5473],
     | 99.00th=[13435], 99.50th=[14615], 99.90th=[34866], 99.95th=[35390],
     | 99.99th=[45876]
   bw (  KiB/s): min=  776, max= 1192, per=100.00%, avg=989.00, stdev=55.89, samples=600
   iops        : min=  194, max=  298, avg=247.23, stdev=13.97, samples=600
  lat (usec)   : 250=0.09%, 500=0.11%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.31%, 4=68.65%, 10=27.51%, 20=3.05%, 50=0.26%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.27%, sys=0.91%, ctx=74182, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,74171,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=985KiB/s (1009kB/s), 985KiB/s-985KiB/s (1009kB/s-1009kB/s), io=173MiB (182MB), run=180002-180002msec

Run status group 1 (all jobs):
  WRITE: bw=989KiB/s (1013kB/s), 989KiB/s-989KiB/s (1013kB/s-1013kB/s), io=290MiB (304MB), run=300001-300001msec

Disk stats (read/write):
  sdc: ios=86/118461, merge=0/0, ticks=36/472485, in_queue=472354, util=98.39%