src/exps/fio_benchmarks/paperexps/CMR-16G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=21987: Fri Sep 28 21:30:13 2018
  write: IOPS=304, BW=1217KiB/s (1246kB/s)(214MiB/180001msec)
    clat (usec): min=163, max=94639, avg=3277.42, stdev=2165.90
     lat (usec): min=163, max=94640, avg=3278.28, stdev=2165.90
    clat percentiles (usec):
     |  1.00th=[ 1549],  5.00th=[ 2376], 10.00th=[ 2507], 20.00th=[ 2606],
     | 30.00th=[ 2737], 40.00th=[ 2900], 50.00th=[ 2999], 60.00th=[ 3064],
     | 70.00th=[ 3195], 80.00th=[ 3359], 90.00th=[ 3720], 95.00th=[ 4293],
     | 99.00th=[13173], 99.50th=[13304], 99.90th=[24773], 99.95th=[34341],
     | 99.99th=[74974]
   bw (  KiB/s): min=  773, max= 1739, per=78.52%, avg=955.58, stdev=69.08, samples=359
   iops        : min=  193, max=  434, avg=238.55, stdev=17.26, samples=359
  lat (usec)   : 250=0.24%, 500=0.55%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=1.54%, 4=90.93%, 10=4.39%, 20=2.09%, 50=0.21%
  lat (msec)   : 100=0.02%
  cpu          : usr=0.34%, sys=1.00%, ctx=54775, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,54771,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=22243: Fri Sep 28 21:30:13 2018
  write: IOPS=305, BW=1221KiB/s (1250kB/s)(358MiB/300003msec)
    clat (usec): min=168, max=85154, avg=3267.21, stdev=2011.88
     lat (usec): min=168, max=85154, avg=3268.05, stdev=2011.88
    clat percentiles (usec):
     |  1.00th=[ 1598],  5.00th=[ 2376], 10.00th=[ 2507], 20.00th=[ 2638],
     | 30.00th=[ 2769], 40.00th=[ 2900], 50.00th=[ 2999], 60.00th=[ 3097],
     | 70.00th=[ 3195], 80.00th=[ 3392], 90.00th=[ 3720], 95.00th=[ 4228],
     | 99.00th=[13173], 99.50th=[13304], 99.90th=[24773], 99.95th=[34341],
     | 99.99th=[59507]
   bw (  KiB/s): min=  800, max= 1760, per=100.00%, avg=1220.97, stdev=70.02, samples=600
   iops        : min=  200, max=  440, avg=305.23, stdev=17.50, samples=600
  lat (usec)   : 250=0.17%, 500=0.48%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=1.49%, 4=91.46%, 10=4.28%, 20=1.87%, 50=0.22%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.32%, sys=1.01%, ctx=91583, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,91571,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1217KiB/s (1246kB/s), 1217KiB/s-1217KiB/s (1246kB/s-1246kB/s), io=214MiB (224MB), run=180001-180001msec

Run status group 1 (all jobs):
  WRITE: bw=1221KiB/s (1250kB/s), 1221KiB/s-1221KiB/s (1250kB/s-1250kB/s), io=358MiB (375MB), run=300003-300003msec

Disk stats (read/write):
  sdc: ios=84/146293, merge=0/0, ticks=72/470763, in_queue=470614, util=98.03%