src/exps/fio_benchmarks/paperexps/CMR-1G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=19036: Fri Sep 28 20:58:10 2018
  write: IOPS=374, BW=1497KiB/s (1533kB/s)(263MiB/180003msec)
    clat (usec): min=157, max=84358, avg=2663.63, stdev=2188.27
     lat (usec): min=157, max=84359, avg=2664.46, stdev=2188.26
    clat percentiles (usec):
     |  1.00th=[  225],  5.00th=[  281], 10.00th=[ 1401], 20.00th=[ 1876],
     | 30.00th=[ 2278], 40.00th=[ 2507], 50.00th=[ 2573], 60.00th=[ 2638],
     | 70.00th=[ 2704], 80.00th=[ 2835], 90.00th=[ 3261], 95.00th=[ 4293],
     | 99.00th=[12125], 99.50th=[12780], 99.90th=[24249], 99.95th=[24773],
     | 99.99th=[34341]
   bw (  KiB/s): min=  945, max= 2074, per=78.75%, avg=1178.08, stdev=75.71, samples=359
   iops        : min=  236, max=  518, avg=294.13, stdev=18.93, samples=359
  lat (usec)   : 250=2.68%, 500=6.75%, 750=0.04%, 1000=0.04%
  lat (msec)   : 2=13.72%, 4=70.76%, 10=3.57%, 20=2.08%, 50=0.35%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.38%, sys=1.20%, ctx=67361, majf=0, minf=30
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,67358,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=19294: Fri Sep 28 20:58:10 2018
  write: IOPS=372, BW=1491KiB/s (1527kB/s)(437MiB/300011msec)
    clat (usec): min=155, max=84063, avg=2673.54, stdev=2210.72
     lat (usec): min=156, max=84064, avg=2674.34, stdev=2210.71
    clat percentiles (usec):
     |  1.00th=[  225],  5.00th=[  285], 10.00th=[ 1450], 20.00th=[ 1893],
     | 30.00th=[ 2278], 40.00th=[ 2507], 50.00th=[ 2573], 60.00th=[ 2638],
     | 70.00th=[ 2704], 80.00th=[ 2835], 90.00th=[ 3261], 95.00th=[ 4293],
     | 99.00th=[12125], 99.50th=[13173], 99.90th=[24249], 99.95th=[29230],
     | 99.99th=[34341]
   bw (  KiB/s): min= 1064, max= 2032, per=100.00%, avg=1491.43, stdev=81.13, samples=600
   iops        : min=  266, max=  508, avg=372.83, stdev=20.28, samples=600
  lat (usec)   : 250=2.53%, 500=6.59%, 750=0.03%, 1000=0.05%
  lat (msec)   : 2=13.47%, 4=71.42%, 10=3.47%, 20=2.09%, 50=0.35%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.37%, sys=1.18%, ctx=111858, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,111851,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1497KiB/s (1533kB/s), 1497KiB/s-1497KiB/s (1533kB/s-1533kB/s), io=263MiB (276MB), run=180003-180003msec

Run status group 1 (all jobs):
  WRITE: bw=1491KiB/s (1527kB/s), 1491KiB/s-1491KiB/s (1527kB/s-1527kB/s), io=437MiB (458MB), run=300011-300011msec

Disk stats (read/write):
  sdc: ios=125/179153, merge=0/0, ticks=75/469318, in_queue=469127, util=97.72%