src/exps/fio_benchmarks/paperexps/CMR-1T.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=26325: Fri Sep 28 22:18:17 2018
  write: IOPS=191, BW=767KiB/s (785kB/s)(135MiB/180001msec)
    clat (usec): min=195, max=76915, avg=5205.27, stdev=2889.90
     lat (usec): min=196, max=76916, avg=5206.12, stdev=2889.90
    clat percentiles (usec):
     |  1.00th=[ 2474],  5.00th=[ 3064], 10.00th=[ 3359], 20.00th=[ 3785],
     | 30.00th=[ 4178], 40.00th=[ 4555], 50.00th=[ 4883], 60.00th=[ 5145],
     | 70.00th=[ 5473], 80.00th=[ 5800], 90.00th=[ 6390], 95.00th=[ 7373],
     | 99.00th=[16057], 99.50th=[17171], 99.90th=[37487], 99.95th=[44827],
     | 99.99th=[46924]
   bw (  KiB/s): min=  506, max= 1297, per=80.34%, avg=616.23, stdev=48.80, samples=359
   iops        : min=  126, max=  324, avg=153.69, stdev=12.22, samples=359
  lat (usec)   : 250=0.11%, 500=0.17%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.10%, 4=24.69%, 10=71.36%, 20=3.20%, 50=0.35%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.20%, sys=0.73%, ctx=34522, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,34518,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=26581: Fri Sep 28 22:18:17 2018
  write: IOPS=193, BW=775KiB/s (794kB/s)(227MiB/300005msec)
    clat (usec): min=196, max=86193, avg=5150.03, stdev=2850.37
     lat (usec): min=197, max=86194, avg=5150.88, stdev=2850.37
    clat percentiles (usec):
     |  1.00th=[ 2507],  5.00th=[ 3064], 10.00th=[ 3359], 20.00th=[ 3785],
     | 30.00th=[ 4146], 40.00th=[ 4490], 50.00th=[ 4817], 60.00th=[ 5080],
     | 70.00th=[ 5407], 80.00th=[ 5735], 90.00th=[ 6259], 95.00th=[ 7046],
     | 99.00th=[15795], 99.50th=[16909], 99.90th=[37487], 99.95th=[46400],
     | 99.99th=[64750]
   bw (  KiB/s): min=  552, max= 1088, per=100.00%, avg=775.31, stdev=46.19, samples=600
   iops        : min=  138, max=  272, avg=193.82, stdev=11.55, samples=600
  lat (usec)   : 250=0.03%, 500=0.07%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.09%, 4=25.23%, 10=71.25%, 20=2.96%, 50=0.35%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.21%, sys=0.66%, ctx=58154, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,58147,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=767KiB/s (785kB/s), 767KiB/s-767KiB/s (785kB/s-785kB/s), io=135MiB (141MB), run=180001-180001msec

Run status group 1 (all jobs):
  WRITE: bw=775KiB/s (794kB/s), 775KiB/s-775KiB/s (794kB/s-794kB/s), io=227MiB (238MB), run=300005-300005msec

Disk stats (read/write):
  sdc: ios=84/92631, merge=0/0, ticks=29/474059, in_queue=473947, util=98.73%